In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Data-cleaning-for-beginners-using-pandas.csv')

In [3]:
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2   NaN  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

HANDLING MISSING VALUES

In [4]:
df.isnull().sum()

Index          0
Age            7
Salary         0
Rating         1
Location       0
Established    0
Easy Apply     0
dtype: int64

In [5]:
age = round(df['Age'].mean(),1)

In [6]:
age

39.0

In [7]:
df['Age'] = df.Age.fillna(age)

In [8]:
df[df['Rating'].isnull()]

    Index   Age     Salary  Rating  Location  Established Easy Apply
26     26  39.0  $55k-$66k     NaN  India,In         1934       TRUE

In [9]:
df['Rating'] = df.Rating.fillna(df['Rating'].median())

In [10]:
df.isnull().sum()

Index          0
Age            0
Salary         0
Rating         0
Location       0
Established    0
Easy Apply     0
dtype: int64

CHECKING DATA TYPES

In [11]:
df.dtypes

Index            int64
Age            float64
Salary          object
Rating         float64
Location        object
Established      int64
Easy Apply      object
dtype: object

In [81]:
## Index Age Rating Established are Numericals.
## Salary and Easy Apply are categorical
## Salary should be in numerical so we will convert it

Outliers using IQR method

In [71]:
Q1 = df[['Age','Salary','Rating']].quantile(0.25)
Q3 = df[['Age','Salary','Rating']].quantile(0.75)

In [72]:
Q1, Q3

(Age       32.0
 Rating     1.4
 Name: 0.25, dtype: float64,
 Age       44.0
 Rating     5.4
 Name: 0.75, dtype: float64)

In [73]:
IQR = Q3-Q1

In [74]:
IQR

Age       12.0
Rating     4.0
dtype: float64

In [79]:
lower_fence = (Q1 - 1.5*IQR)
lower_fence

Age       14.0
Rating    -4.6
dtype: float64

In [80]:
upper_fence = (Q3 + 1.5*IQR)
upper_fence

Age       62.0
Rating    11.4
dtype: float64

In [82]:
##Anything lower than Age = 14 and rating = -4.6 and upper than Age = 62 and Rating = 11.4 are outliers

In [83]:
##Dataset is small so we should not remove the outlier. we can convert salary range into the average between two numbers.

In [13]:
df.head()

   Index   Age     Salary  Rating       Location  Established Easy Apply
0      0  44.0  $44k-$99k     5.4       India,In         1999       TRUE
1      1  66.0  $55k-$66k     3.5    New York,Ny         2002       TRUE
2      2  39.0  $77k-$89k    -1.0    New York,Ny           -1         -1
3      3  64.0  $44k-$99k     4.4       India In         1988         -1
4      4  25.0  $44k-$99k     6.4  Australia Aus         2002         -1

In [37]:
df2 = df.copy()

Salary Formatting

In [38]:
df2['Salary'].unique

<bound method Series.unique of 0      $44k-$99k
1      $55k-$66k
2      $77k-$89k
3      $44k-$99k
4      $44k-$99k
5      $77k-$89k
6      $44k-$99k
7      $44k-$99k
8      $44k-$99k
9      $44k-$99k
10     $10k-$49k
11     $10k-$49k
12     $44k-$99k
13     $44k-$99k
14     $44k-$99k
15    $88k-$101k
16     $19k-$40k
17     $44k-$99k
18     $44k-$99k
19     $44k-$99k
20     $44k-$99k
21     $44k-$99k
22     $55k-$66k
23     $44k-$99k
24     $44k-$99k
25     $44k-$99k
26     $55k-$66k
27     $44k-$99k
28     $39k-$88k
Name: Salary, dtype: object>

In [39]:
df2['Salary'] = df2.Salary.str.replace('$','').str.replace('k','000')

C:\Users\Piyush Rawat\AppData\Local\Temp\ipykernel_6104\1525845370.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df2['Salary'] = df2.Salary.str.replace('$','').str.replace('k','000')

In [40]:
df2.head()

   Index   Age       Salary  Rating       Location  Established Easy Apply
0      0  44.0  44000-99000     5.4       India,In         1999       TRUE
1      1  66.0  55000-66000     3.5    New York,Ny         2002       TRUE
2      2  39.0  77000-89000    -1.0    New York,Ny           -1         -1
3      3  64.0  44000-99000     4.4       India In         1988         -1
4      4  25.0  44000-99000     6.4  Australia Aus         2002         -1

In [41]:
df2.Salary = df2['Salary'].str.split('-')

In [42]:
## I will convert the range into the average between the two numbers

In [43]:
df2.head()

   Index   Age          Salary  Rating       Location  Established Easy Apply
0      0  44.0  [44000, 99000]     5.4       India,In         1999       TRUE
1      1  66.0  [55000, 66000]     3.5    New York,Ny         2002       TRUE
2      2  39.0  [77000, 89000]    -1.0    New York,Ny           -1         -1
3      3  64.0  [44000, 99000]     4.4       India In         1988         -1
4      4  25.0  [44000, 99000]     6.4  Australia Aus         2002         -1

In [44]:
def convert_salary(salary):
    salary = list(map(int, salary))
    return sum(salary)/len(salary)

In [45]:
df2.Salary = df2['Salary'].apply(convert_salary)

In [46]:
df2.head()

   Index   Age   Salary  Rating       Location  Established Easy Apply
0      0  44.0  71500.0     5.4       India,In         1999       TRUE
1      1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2      2  39.0  83000.0    -1.0    New York,Ny           -1         -1
3      3  64.0  71500.0     4.4       India In         1988         -1
4      4  25.0  71500.0     6.4  Australia Aus         2002         -1

Fixing Rating column if there is any value in negative it will be 0

In [47]:
def rating(col):
    if col < 0:
        return 0
    else:
        return col

In [48]:
df2['Rating'] = df2.Rating.apply(rating)

In [49]:
df2.head()

   Index   Age   Salary  Rating       Location  Established Easy Apply
0      0  44.0  71500.0     5.4       India,In         1999       TRUE
1      1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2      2  39.0  83000.0     0.0    New York,Ny           -1         -1
3      3  64.0  71500.0     4.4       India In         1988         -1
4      4  25.0  71500.0     6.4  Australia Aus         2002         -1

Replacing -1 in established with its median and -1 in Easy apply with False

In [50]:
df2['Established'] = df2['Established'].replace(-1,df2.Established.median())

In [51]:
df2['Easy Apply'] = df2['Easy Apply'].str.replace('-1', 'FALSE')

In [52]:
df2.head()

   Index   Age   Salary  Rating       Location  Established Easy Apply
0      0  44.0  71500.0     5.4       India,In         1999       TRUE
1      1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2      2  39.0  83000.0     0.0    New York,Ny         1984      FALSE
3      3  64.0  71500.0     4.4       India In         1988      FALSE
4      4  25.0  71500.0     6.4  Australia Aus         2002      FALSE

In [53]:
## Fixing Location column
df2.Location.unique

<bound method Series.unique of 0          India,In
1       New York,Ny
2       New York,Ny
3          India In
4     Australia Aus
5          India,In
6       New York,Ny
7     Australia Aus
8       New York,Ny
9          India,In
10         India,In
11         India,In
12         India,In
13    Australia Aus
14    Australia Aus
15    Australia Aus
16         India,In
17      New York,Ny
18      New York,Ny
19      New York,Ny
20      New York,Ny
21      New York,Ny
22      New York,Ny
23      New York,Ny
24      New York,Ny
25    Australia Aus
26         India,In
27         India,In
28    Australia Aus
Name: Location, dtype: object>

In [54]:
def loc(location):
    location = location.replace('India In', 'India,In').replace('Australia Aus','Australia,Aus')
    #Ensuring constant delimiter
    if ',' not in location:
        location = location.replace(' ',',')
    return location

In [55]:
df2.Location = df2['Location'].apply(loc)

In [56]:
df2

    Index   Age   Salary  Rating       Location  Established Easy Apply
0       0  44.0  71500.0     5.4       India,In         1999       TRUE
1       1  66.0  60500.0     3.5    New York,Ny         2002       TRUE
2       2  39.0  83000.0     0.0    New York,Ny         1984      FALSE
3       3  64.0  71500.0     4.4       India,In         1988      FALSE
4       4  25.0  71500.0     6.4  Australia,Aus         2002      FALSE
5       5  44.0  83000.0     1.4       India,In         1999       TRUE
6       6  21.0  71500.0     0.0    New York,Ny         1984      FALSE
7       7  44.0  71500.0     0.0  Australia,Aus         1984      FALSE
8       8  35.0  71500.0     5.4    New York,Ny         1984      FALSE
9       9  22.0  71500.0     7.7       India,In         1984       TRUE
10     10  55.0  29500.0     5.4       India,In         2008       TRUE
11     11  44.0  29500.0     6.7       India,In         2009      FALSE
12     12  39.0  71500.0     0.0       India,In         1999      FALSE
13     13  25.0  71500.0     0.0  Australia,Aus         2019       TRUE
14     14  66.0  71500.0     4.0  Australia,Aus         2020       TRUE
15     15  44.0  94500.0     3.0  Australia,Aus         1999      FALSE
16     16  19.0  29500.0     4.5       India,In         1984      FALSE
17     17  39.0  71500.0     5.3    New York,Ny         1943       TRUE
18     18  35.0  71500.0     6.7    New York,Ny         1954       TRUE
19     19  32.0  71500.0     3.3    New York,Ny         1955       TRUE
20     20  39.0  71500.0     5.7    New York,Ny         1944       TRUE
21     21  35.0  71500.0     5.0    New York,Ny         1946      FALSE
22     22  19.0  60500.0     7.8    New York,Ny         1988       TRUE
23     23  39.0  71500.0     2.4    New York,Ny         1999       TRUE
24     24  13.0  71500.0     0.0    New York,Ny         1987      FALSE
25     25  55.0  71500.0     0.0  Australia,Aus         1980       TRUE
26     26  39.0  60500.0     4.2       India,In         1934       TRUE
27     27  52.0  71500.0     5.4       India,In         1935      FALSE
28     28  39.0  63500.0     3.4  Australia,Aus         1932      FALSE

In [57]:
## Here the data cleanning is complete